; domain
;; source: https://github.com/AI-Planning/pddl-generators/blob/main/floortile/domain.pddl
;; updates:
;;   - :action-costs removed
;;   - movements updated to move_* to avoid repeating action and predicate names, e.g., up pred. with up act.
;;   - all action names use underscore

(define (domain floortile)
(:requirements :typing)
(:types robot tile color - object)

(:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (down ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (left ?x - tile ?y - tile)
    (clear ?x - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
    (free-color ?r - robot))

(:action change_color
  :parameters (?r - robot ?c - color ?c2 - color)
  :precondition (and (robot-has ?r ?c) (available-color ?c2))
  :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2))
)

(:action paint_up
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

(:action paint_down
  :parameters (?r - robot ?y - tile ?x - tile ?c - color)
  :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (not (clear ?y)) (painted ?y ?c))
)

; Robot movements
(:action move_up
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (up ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_down
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (down ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_right
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (right ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

(:action move_left
  :parameters (?r - robot ?x - tile ?y - tile)
  :precondition (and (robot-at ?r ?x) (left ?y ?x) (clear ?y))
  :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x))
               (clear ?x) (not (clear ?y)))
)

)

; problem
;; rows=3, columns=8, robots=1, out_folder=training/easy, instance_id=39, seed=64

(define (problem floortile-39)
 (:domain floortile)
 (:objects 
    tile_0_1
    tile_0_2
    tile_0_3
    tile_0_4
    tile_0_5
    tile_0_6
    tile_0_7
    tile_0_8
    tile_1_1
    tile_1_2
    tile_1_3
    tile_1_4
    tile_1_5
    tile_1_6
    tile_1_7
    tile_1_8
    tile_2_1
    tile_2_2
    tile_2_3
    tile_2_4
    tile_2_5
    tile_2_6
    tile_2_7
    tile_2_8
    tile_3_1
    tile_3_2
    tile_3_3
    tile_3_4
    tile_3_5
    tile_3_6
    tile_3_7
    tile_3_8 - tile
    robot1 - robot
    white black - color
)
 (:init 
    (robot-at robot1 tile_1_2)
    (robot-has robot1 black)
    (available-color white)
    (available-color black)
    (clear tile_0_1)
    (clear tile_0_2)
    (clear tile_0_3)
    (clear tile_0_4)
    (clear tile_0_5)
    (clear tile_0_6)
    (clear tile_0_7)
    (clear tile_0_8)
    (clear tile_1_1)
    (clear tile_1_3)
    (clear tile_1_4)
    (clear tile_1_5)
    (clear tile_1_6)
    (clear tile_1_7)
    (clear tile_1_8)
    (clear tile_2_1)
    (clear tile_2_2)
    (clear tile_2_3)
    (clear tile_2_4)
    (clear tile_2_5)
    (clear tile_2_6)
    (clear tile_2_7)
    (clear tile_2_8)
    (clear tile_3_1)
    (clear tile_3_2)
    (clear tile_3_3)
    (clear tile_3_4)
    (clear tile_3_5)
    (clear tile_3_6)
    (clear tile_3_7)
    (clear tile_3_8)
    (up tile_1_1 tile_0_1 )
    (up tile_1_2 tile_0_2 )
    (up tile_1_3 tile_0_3 )
    (up tile_1_4 tile_0_4 )
    (up tile_1_5 tile_0_5 )
    (up tile_1_6 tile_0_6 )
    (up tile_1_7 tile_0_7 )
    (up tile_1_8 tile_0_8 )
    (up tile_2_1 tile_1_1 )
    (up tile_2_2 tile_1_2 )
    (up tile_2_3 tile_1_3 )
    (up tile_2_4 tile_1_4 )
    (up tile_2_5 tile_1_5 )
    (up tile_2_6 tile_1_6 )
    (up tile_2_7 tile_1_7 )
    (up tile_2_8 tile_1_8 )
    (up tile_3_1 tile_2_1 )
    (up tile_3_2 tile_2_2 )
    (up tile_3_3 tile_2_3 )
    (up tile_3_4 tile_2_4 )
    (up tile_3_5 tile_2_5 )
    (up tile_3_6 tile_2_6 )
    (up tile_3_7 tile_2_7 )
    (up tile_3_8 tile_2_8 )
    (down tile_0_1 tile_1_1 )
    (down tile_0_2 tile_1_2 )
    (down tile_0_3 tile_1_3 )
    (down tile_0_4 tile_1_4 )
    (down tile_0_5 tile_1_5 )
    (down tile_0_6 tile_1_6 )
    (down tile_0_7 tile_1_7 )
    (down tile_0_8 tile_1_8 )
    (down tile_1_1 tile_2_1 )
    (down tile_1_2 tile_2_2 )
    (down tile_1_3 tile_2_3 )
    (down tile_1_4 tile_2_4 )
    (down tile_1_5 tile_2_5 )
    (down tile_1_6 tile_2_6 )
    (down tile_1_7 tile_2_7 )
    (down tile_1_8 tile_2_8 )
    (down tile_2_1 tile_3_1 )
    (down tile_2_2 tile_3_2 )
    (down tile_2_3 tile_3_3 )
    (down tile_2_4 tile_3_4 )
    (down tile_2_5 tile_3_5 )
    (down tile_2_6 tile_3_6 )
    (down tile_2_7 tile_3_7 )
    (down tile_2_8 tile_3_8 )
    (left tile_0_1 tile_0_2 )
    (left tile_0_2 tile_0_3 )
    (left tile_0_3 tile_0_4 )
    (left tile_0_4 tile_0_5 )
    (left tile_0_5 tile_0_6 )
    (left tile_0_6 tile_0_7 )
    (left tile_0_7 tile_0_8 )
    (left tile_1_1 tile_1_2 )
    (left tile_1_2 tile_1_3 )
    (left tile_1_3 tile_1_4 )
    (left tile_1_4 tile_1_5 )
    (left tile_1_5 tile_1_6 )
    (left tile_1_6 tile_1_7 )
    (left tile_1_7 tile_1_8 )
    (left tile_2_1 tile_2_2 )
    (left tile_2_2 tile_2_3 )
    (left tile_2_3 tile_2_4 )
    (left tile_2_4 tile_2_5 )
    (left tile_2_5 tile_2_6 )
    (left tile_2_6 tile_2_7 )
    (left tile_2_7 tile_2_8 )
    (left tile_3_1 tile_3_2 )
    (left tile_3_2 tile_3_3 )
    (left tile_3_3 tile_3_4 )
    (left tile_3_4 tile_3_5 )
    (left tile_3_5 tile_3_6 )
    (left tile_3_6 tile_3_7 )
    (left tile_3_7 tile_3_8 )
    (right tile_0_2 tile_0_1 )
    (right tile_0_3 tile_0_2 )
    (right tile_0_4 tile_0_3 )
    (right tile_0_5 tile_0_4 )
    (right tile_0_6 tile_0_5 )
    (right tile_0_7 tile_0_6 )
    (right tile_0_8 tile_0_7 )
    (right tile_1_2 tile_1_1 )
    (right tile_1_3 tile_1_2 )
    (right tile_1_4 tile_1_3 )
    (right tile_1_5 tile_1_4 )
    (right tile_1_6 tile_1_5 )
    (right tile_1_7 tile_1_6 )
    (right tile_1_8 tile_1_7 )
    (right tile_2_2 tile_2_1 )
    (right tile_2_3 tile_2_2 )
    (right tile_2_4 tile_2_3 )
    (right tile_2_5 tile_2_4 )
    (right tile_2_6 tile_2_5 )
    (right tile_2_7 tile_2_6 )
    (right tile_2_8 tile_2_7 )
    (right tile_3_2 tile_3_1 )
    (right tile_3_3 tile_3_2 )
    (right tile_3_4 tile_3_3 )
    (right tile_3_5 tile_3_4 )
    (right tile_3_6 tile_3_5 )
    (right tile_3_7 tile_3_6 )
    (right tile_3_8 tile_3_7 ))
 (:goal  (and 
    (painted tile_1_1 white)
    (painted tile_1_2 black)
    (painted tile_1_3 white)
    (painted tile_1_4 black)
    (painted tile_1_5 white)
    (painted tile_1_6 black)
    (painted tile_1_7 white)
    (painted tile_1_8 black)
    (painted tile_2_1 black)
    (painted tile_2_2 white)
    (painted tile_2_3 black)
    (painted tile_2_4 white)
    (painted tile_2_5 black)
    (painted tile_2_6 white)
    (painted tile_2_7 black)
    (painted tile_2_8 white)
    (painted tile_3_1 white)
    (painted tile_3_2 black)
    (painted tile_3_3 white)
    (painted tile_3_4 black)
    (painted tile_3_5 white)
    (painted tile_3_6 black)
    (painted tile_3_7 white)
    (painted tile_3_8 black))))

; plan
1. (move_up robot1 tile_1_2 tile_2_2)
   deleted: (robot-at robot1 tile_1_2) (clear tile_2_2)
   added: (robot-at robot1 tile_2_2) (clear tile_1_2)
   goals met: 0 of 24
2. (paint_up robot1 tile_3_2 tile_2_2 black)
   deleted: (clear tile_3_2)
   added: (painted tile_3_2 black)
   goals met: 1 of 24
3. (move_right robot1 tile_2_2 tile_2_3)
   deleted: (robot-at robot1 tile_2_2) (clear tile_2_3)
   added: (robot-at robot1 tile_2_3) (clear tile_2_2)
   goals met: 1 of 24
4. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 1 of 24
5. (paint_up robot1 tile_3_3 tile_2_3 white)
   deleted: (clear tile_3_3)
   added: (painted tile_3_3 white)
   goals met: 2 of 24
6. (move_down robot1 tile_2_3 tile_1_3)
   deleted: (robot-at robot1 tile_2_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_2_3)
   goals met: 2 of 24
7. (move_left robot1 tile_1_3 tile_1_2)
   deleted: (robot-at robot1 tile_1_3) (clear tile_1_2)
   added: (robot-at robot1 tile_1_2) (clear tile_1_3)
   goals met: 2 of 24
8. (paint_up robot1 tile_2_2 tile_1_2 white)
   deleted: (clear tile_2_2)
   added: (painted tile_2_2 white)
   goals met: 3 of 24
9. (move_left robot1 tile_1_2 tile_1_1)
   deleted: (robot-at robot1 tile_1_2) (clear tile_1_1)
   added: (robot-at robot1 tile_1_1) (clear tile_1_2)
   goals met: 3 of 24
10. (move_up robot1 tile_1_1 tile_2_1)
   deleted: (robot-at robot1 tile_1_1) (clear tile_2_1)
   added: (robot-at robot1 tile_2_1) (clear tile_1_1)
   goals met: 3 of 24
11. (paint_up robot1 tile_3_1 tile_2_1 white)
   deleted: (clear tile_3_1)
   added: (painted tile_3_1 white)
   goals met: 4 of 24
12. (move_down robot1 tile_2_1 tile_1_1)
   deleted: (robot-at robot1 tile_2_1) (clear tile_1_1)
   added: (robot-at robot1 tile_1_1) (clear tile_2_1)
   goals met: 4 of 24
13. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 4 of 24
14. (paint_up robot1 tile_2_1 tile_1_1 black)
   deleted: (clear tile_2_1)
   added: (painted tile_2_1 black)
   goals met: 5 of 24
15. (move_down robot1 tile_1_1 tile_0_1)
   deleted: (robot-at robot1 tile_1_1) (clear tile_0_1)
   added: (robot-at robot1 tile_0_1) (clear tile_1_1)
   goals met: 5 of 24
16. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 5 of 24
17. (paint_up robot1 tile_1_1 tile_0_1 white)
   deleted: (clear tile_1_1)
   added: (painted tile_1_1 white)
   goals met: 6 of 24
18. (move_right robot1 tile_0_1 tile_0_2)
   deleted: (robot-at robot1 tile_0_1) (clear tile_0_2)
   added: (robot-at robot1 tile_0_2) (clear tile_0_1)
   goals met: 6 of 24
19. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 6 of 24
20. (paint_up robot1 tile_1_2 tile_0_2 black)
   deleted: (clear tile_1_2)
   added: (painted tile_1_2 black)
   goals met: 7 of 24
21. (move_right robot1 tile_0_2 tile_0_3)
   deleted: (robot-at robot1 tile_0_2) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_0_2)
   goals met: 7 of 24
22. (move_up robot1 tile_0_3 tile_1_3)
   deleted: (robot-at robot1 tile_0_3) (clear tile_1_3)
   added: (robot-at robot1 tile_1_3) (clear tile_0_3)
   goals met: 7 of 24
23. (paint_up robot1 tile_2_3 tile_1_3 black)
   deleted: (clear tile_2_3)
   added: (painted tile_2_3 black)
   goals met: 8 of 24
24. (move_right robot1 tile_1_3 tile_1_4)
   deleted: (robot-at robot1 tile_1_3) (clear tile_1_4)
   added: (robot-at robot1 tile_1_4) (clear tile_1_3)
   goals met: 8 of 24
25. (move_up robot1 tile_1_4 tile_2_4)
   deleted: (robot-at robot1 tile_1_4) (clear tile_2_4)
   added: (robot-at robot1 tile_2_4) (clear tile_1_4)
   goals met: 8 of 24
26. (paint_up robot1 tile_3_4 tile_2_4 black)
   deleted: (clear tile_3_4)
   added: (painted tile_3_4 black)
   goals met: 9 of 24
27. (move_right robot1 tile_2_4 tile_2_5)
   deleted: (robot-at robot1 tile_2_4) (clear tile_2_5)
   added: (robot-at robot1 tile_2_5) (clear tile_2_4)
   goals met: 9 of 24
28. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 9 of 24
29. (paint_up robot1 tile_3_5 tile_2_5 white)
   deleted: (clear tile_3_5)
   added: (painted tile_3_5 white)
   goals met: 10 of 24
30. (move_right robot1 tile_2_5 tile_2_6)
   deleted: (robot-at robot1 tile_2_5) (clear tile_2_6)
   added: (robot-at robot1 tile_2_6) (clear tile_2_5)
   goals met: 10 of 24
31. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 10 of 24
32. (paint_up robot1 tile_3_6 tile_2_6 black)
   deleted: (clear tile_3_6)
   added: (painted tile_3_6 black)
   goals met: 11 of 24
33. (move_down robot1 tile_2_6 tile_1_6)
   deleted: (robot-at robot1 tile_2_6) (clear tile_1_6)
   added: (robot-at robot1 tile_1_6) (clear tile_2_6)
   goals met: 11 of 24
34. (move_left robot1 tile_1_6 tile_1_5)
   deleted: (robot-at robot1 tile_1_6) (clear tile_1_5)
   added: (robot-at robot1 tile_1_5) (clear tile_1_6)
   goals met: 11 of 24
35. (paint_up robot1 tile_2_5 tile_1_5 black)
   deleted: (clear tile_2_5)
   added: (painted tile_2_5 black)
   goals met: 12 of 24
36. (move_left robot1 tile_1_5 tile_1_4)
   deleted: (robot-at robot1 tile_1_5) (clear tile_1_4)
   added: (robot-at robot1 tile_1_4) (clear tile_1_5)
   goals met: 12 of 24
37. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 12 of 24
38. (paint_up robot1 tile_2_4 tile_1_4 white)
   deleted: (clear tile_2_4)
   added: (painted tile_2_4 white)
   goals met: 13 of 24
39. (move_down robot1 tile_1_4 tile_0_4)
   deleted: (robot-at robot1 tile_1_4) (clear tile_0_4)
   added: (robot-at robot1 tile_0_4) (clear tile_1_4)
   goals met: 13 of 24
40. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 13 of 24
41. (paint_up robot1 tile_1_4 tile_0_4 black)
   deleted: (clear tile_1_4)
   added: (painted tile_1_4 black)
   goals met: 14 of 24
42. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 14 of 24
43. (move_left robot1 tile_0_4 tile_0_3)
   deleted: (robot-at robot1 tile_0_4) (clear tile_0_3)
   added: (robot-at robot1 tile_0_3) (clear tile_0_4)
   goals met: 14 of 24
44. (paint_up robot1 tile_1_3 tile_0_3 white)
   deleted: (clear tile_1_3)
   added: (painted tile_1_3 white)
   goals met: 15 of 24
45. (move_right robot1 tile_0_3 tile_0_4)
   deleted: (robot-at robot1 tile_0_3) (clear tile_0_4)
   added: (robot-at robot1 tile_0_4) (clear tile_0_3)
   goals met: 15 of 24
46. (move_right robot1 tile_0_4 tile_0_5)
   deleted: (robot-at robot1 tile_0_4) (clear tile_0_5)
   added: (robot-at robot1 tile_0_5) (clear tile_0_4)
   goals met: 15 of 24
47. (paint_up robot1 tile_1_5 tile_0_5 white)
   deleted: (clear tile_1_5)
   added: (painted tile_1_5 white)
   goals met: 16 of 24
48. (move_right robot1 tile_0_5 tile_0_6)
   deleted: (robot-at robot1 tile_0_5) (clear tile_0_6)
   added: (robot-at robot1 tile_0_6) (clear tile_0_5)
   goals met: 16 of 24
49. (move_up robot1 tile_0_6 tile_1_6)
   deleted: (robot-at robot1 tile_0_6) (clear tile_1_6)
   added: (robot-at robot1 tile_1_6) (clear tile_0_6)
   goals met: 16 of 24
50. (paint_up robot1 tile_2_6 tile_1_6 white)
   deleted: (clear tile_2_6)
   added: (painted tile_2_6 white)
   goals met: 17 of 24
51. (move_right robot1 tile_1_6 tile_1_7)
   deleted: (robot-at robot1 tile_1_6) (clear tile_1_7)
   added: (robot-at robot1 tile_1_7) (clear tile_1_6)
   goals met: 17 of 24
52. (move_up robot1 tile_1_7 tile_2_7)
   deleted: (robot-at robot1 tile_1_7) (clear tile_2_7)
   added: (robot-at robot1 tile_2_7) (clear tile_1_7)
   goals met: 17 of 24
53. (paint_up robot1 tile_3_7 tile_2_7 white)
   deleted: (clear tile_3_7)
   added: (painted tile_3_7 white)
   goals met: 18 of 24
54. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 18 of 24
55. (move_right robot1 tile_2_7 tile_2_8)
   deleted: (robot-at robot1 tile_2_7) (clear tile_2_8)
   added: (robot-at robot1 tile_2_8) (clear tile_2_7)
   goals met: 18 of 24
56. (paint_up robot1 tile_3_8 tile_2_8 black)
   deleted: (clear tile_3_8)
   added: (painted tile_3_8 black)
   goals met: 19 of 24
57. (move_down robot1 tile_2_8 tile_1_8)
   deleted: (robot-at robot1 tile_2_8) (clear tile_1_8)
   added: (robot-at robot1 tile_1_8) (clear tile_2_8)
   goals met: 19 of 24
58. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 19 of 24
59. (paint_up robot1 tile_2_8 tile_1_8 white)
   deleted: (clear tile_2_8)
   added: (painted tile_2_8 white)
   goals met: 20 of 24
60. (change_color robot1 white black)
   deleted: (robot-has robot1 white)
   added: (robot-has robot1 black)
   goals met: 20 of 24
61. (move_left robot1 tile_1_8 tile_1_7)
   deleted: (robot-at robot1 tile_1_8) (clear tile_1_7)
   added: (robot-at robot1 tile_1_7) (clear tile_1_8)
   goals met: 20 of 24
62. (paint_up robot1 tile_2_7 tile_1_7 black)
   deleted: (clear tile_2_7)
   added: (painted tile_2_7 black)
   goals met: 21 of 24
63. (move_down robot1 tile_1_7 tile_0_7)
   deleted: (robot-at robot1 tile_1_7) (clear tile_0_7)
   added: (robot-at robot1 tile_0_7) (clear tile_1_7)
   goals met: 21 of 24
64. (move_right robot1 tile_0_7 tile_0_8)
   deleted: (robot-at robot1 tile_0_7) (clear tile_0_8)
   added: (robot-at robot1 tile_0_8) (clear tile_0_7)
   goals met: 21 of 24
65. (paint_up robot1 tile_1_8 tile_0_8 black)
   deleted: (clear tile_1_8)
   added: (painted tile_1_8 black)
   goals met: 22 of 24
66. (move_left robot1 tile_0_8 tile_0_7)
   deleted: (robot-at robot1 tile_0_8) (clear tile_0_7)
   added: (robot-at robot1 tile_0_7) (clear tile_0_8)
   goals met: 22 of 24
67. (move_left robot1 tile_0_7 tile_0_6)
   deleted: (robot-at robot1 tile_0_7) (clear tile_0_6)
   added: (robot-at robot1 tile_0_6) (clear tile_0_7)
   goals met: 22 of 24
68. (paint_up robot1 tile_1_6 tile_0_6 black)
   deleted: (clear tile_1_6)
   added: (painted tile_1_6 black)
   goals met: 23 of 24
69. (move_right robot1 tile_0_6 tile_0_7)
   deleted: (robot-at robot1 tile_0_6) (clear tile_0_7)
   added: (robot-at robot1 tile_0_7) (clear tile_0_6)
   goals met: 23 of 24
70. (change_color robot1 black white)
   deleted: (robot-has robot1 black)
   added: (robot-has robot1 white)
   goals met: 23 of 24
71. (paint_up robot1 tile_1_7 tile_0_7 white)
   deleted: (clear tile_1_7)
   added: (painted tile_1_7 white)
   goals met: 24 of 24
